Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Using XML as a source format gives us the ability to generate many output formats from the source files, while only maintaining one source document for all formats.
es: Usando XML como código fuente, podemos generar diferentes formatos, manteniendo solamente un solo código fuente para todos los formatos.

source: The tools used for formatting HTML and TeX versions are Jade, written by James Clark and The Modular DocBook Stylesheets written by Norman Walsh.
es: Las herramientas utilizadas para crear las versiones HTML y TeX son Jade, escrito por James Clark y The Modular DocBook Stylesheets, escrito por Norman Walsh.

source: We use Microsoft HTML Help Workshop to generate the Windows HTML Help format of the manual, and of course PHP itself to do some additional conversions and formatting.
es: Usamos Microsoft HTML Help Workshop para generar el formato de ayuda Windows HTML y por supuesto PHP para algunas conversiones y preprocesado.

source: You can download the manual in various languages and formats, including plain text, plain HTML, PDF, PalmPilot DOC, PalmPilot iSilo and Windows HTML Help, from http: / /www.php.net / docs.php.
es: Puedes bajarte el manual en diferentes idiomas y formatos, incluyendo texto plano, HTML, PDF, PalmPilot DOC, PalmPilot iSilo y Windows HTML Help, de http: / /www.php.net / docs.php.

source: The manuals are updated automatically as the text is updated.
es: Los manuales son generados automaticamente a medida que el código fuente se va actualizando.

source: You can find more information about downloading the XML source code of this documentation at http: / /cvs.php.net /.
es: Más información sobre como bajarse el código fuente en XML en http: / /cvs.php.net /.

source: The documentation is stored in the phpdoc module.
es: La documentación se encuentra en el módulo phpdoc

source: How to help improve the documentation
es: Como ayudar a mejorar la documentación

source: Translations
es: Traducciones

source: There are three ways you can help to improve this documentation.
es: Se pueden ayudar de tres maneras a mejorar esta documentción.

source: If you find errors in this manual, in any language, please report them using the bug system at http: / /bugs.php.net /.
es: Si encontrais errores en este manual, en cualquier lenguaje, podeis informar sobre el mismo, usando el sistema de informes de errores en http: / /bugs.php.net /.

source: Classify the bug as "Documentation Problem".
es: Clasificar el error como "Documentation Problem".

source: You can also submit problems related to specific manual formats here.
es: Problemas encontrados con los diferentes formatos tambien se pueden mandar usando este sistema.

source: Please don 't abuse the bug system by submitting requests for help.
es: Por favor, no abusar del sistema de informes de errores mandando peticiones de ayuda.

source: Use the mailing lists or community sites mentioned earlier, instead.
es: Utilizar las listas de correos y recursos mencionados anteriormente.

source: By contributing notes, you can provide additional examples, caveats, and clarifications for other readers.
es: Contribuyendo con notas / comentarios, podeis dar ejemplos adicionales y aclaraciones a otros lectores.

source: But do not submit bug reports using the annotation system please.
es: Pero no mandar informes de errores mediante el sistema de notas / comentarios.

source: You can read more about annotations in the 'About user notes' section of this appendix.
es: Podeis leer más sobre notas / comentarios en la sección 'Sobre las notas de usuarios' de este apendice.

source: If you know English and some foreign language, you may also help out in the translations.
es: Si sabes ingles y otro idioma, podeis ayudar en las traducciones.

source: If you would like to start a new translation, or help in a translation project, please read http: / /cvs.php.net / co.php / phpdoc / howto / howto.html.tar.gz.
es: Si te interesa comenzar una nueva traducción o ayudar una existente, pasate por http: / /cvs.php.net / co.php / phpdoc / howto / howto.html.tar.gz.

source: How to find more information about PHP
es: Como encontrar más información sobre PHP

source: The PHP manual is provided in several formats.
es: El manual de PHP se encuentra disponible en diferentes formatos.

source: These formats can be divided into two groups: online readable formats, and downloadable packages.
es: Estos formatos se pueden dividir en dos grupos: formatos accesible en línea (online) y ficheros que se pueden bajar a tu ordenador.

source: Some publishers have made available printed versions of this manual.
es: Algunos editores han publicado versiones impresas de este manual.

source: We cannot recommend any of those, as they tend to become out-of-date very quickly.
es: No podemos recomendar ninguna de ellas, ya que suelen quedarse obsoletas rápidamente.

source: You can read the manual online at http: / /www.php.net / You can read the manual online at http: / /www.php.net / and on the numerous mirror sites.
es: Podeis leer el manual en linea (online) en http: / /www.php.net / y en numerosos servidores espejo.

source: For best performance, you should choose the mirror site closest to you.
es: Para mejorar la respuesta, deberiais utilizar el servidor espejo más cercano a vosotros.

source: You can view the manual in either its plain (print-friendly) HTML format or an HTML format that integrates the manual into the look and feel of the PHP website itself.
es: Podeis consultar el manual en formato HTML -impresión amigable - ó en formato HTML que integra el manual en el diseno de la página web del proyecto PHP.

source: An advantage of the online manual over most of the offline formats is the integration of user-contributed notes.
es: Una ventaja del manual en línea sobre la mayoria de formatos fuera de línea es la integración de los comentarios / notas de usuarios.

source: An obvious disadvantage is that you have to be online to view the manual in the online formats.
es: Una desventaja es que teneis que estar conectados para ver consultar las versiones en línea.

source: There are several offline formats of the manual, and the most appropriate format for you depends on what operating system you use and your personal reading style.
es: Existen varios formatos fuera de línea y el más apropiado para cada usuario depende del sistema operativo que se use y de tus preferencias a la hora de leer.

source: For information on how the manual is generated in so many formats, read the 'How we generate the formats' section of this appendix.
es: Informacion sobre como el manual es generado en tantos formatos diferentes se puede obtener en la seccion de este apendice titulada 'Como generamos los dierentes formatos'.

source: The HTML format is provided both as a single HTML file and as a package of individual files for each section (which results in a collection of several thousand files).
es: Los formatos HTML y texto plano se distribuyen como ficheros tar y con compresión bz2.

source: The HTML and plaintext formats are provided as tar files compressed using the bzip2 archiver.
es: Otro formato muy popular y el más adecuado para imprimir, es PDF (Adobe Acrobat).

source: Another popular cross-platform format, and the format most suited to printing, is PDF (also known as Adobe Acrobat).
es: Nota:

source: Note:
es: Los usuarios de ordenadores de mano compatibles con Palm, tienen los formatos Palm doc y iSilo.

source: If you do not already have a program capable of viewing PDF format files, you may need to download Adobe Acrobat Reader.
es: Podreis utlizar un lector de documentos DOC ó iSilo para consultar la documentación de PHP o como referencia rápida.

source: For owners of Palm-compatible handhelds, the Palm document and iSilo formats are ideal for this platform.
es: Para plataformas Windows, la versión Windows HTML Ayuda proporciona el formato HTML usado con la aplicacion de ayuda Windows HTML.

source: You can bring your handheld with you on your daily commute and use a DOC or iSilo reader to brush up on your PHP knowledge, or just use it as a quick reference.
es: Muchos entornos de desarrollo para PHP en Windows integran esta versión.

source: This version provides full-text search, a full index, and bookmarking.
es: Un projecto de Visual Basic para Linux se encuentra en fase de planificación, incluirá la creación de "CHM Creator and Viewer" para Linux.

source: Many popular Windows PHP development environments also integrate with this version of the documentation to provide easy access.
es: Podeis consultar la página en SourceForge.net si estais interesados en su progreso.

source: About user notes
es: Sobre las notas de usuarios

source: This manual does not attempt to provide instruction about general programming practices.
es: Este manual no pretende explicar practicas generales de programación.

source: If you are a first-time, or even just a beginning, programmer, you may find it difficult to learn how to program in PHP using just this manual.
es: Si vas a empezar a programar ó eres un programador principiante, seguramente tendras dificultades para aprender a programar en PHP usando solamente este manual.

source: You may want to seek out a text more oriented towards beginners.
es: Te será de gran ayuda utilizar otros textos más orientados a principiantes.

source: You can find a list of PHP-related books at http: / /www.php.net / books.php.
es: Una lista con libros sobre PHP puede encontrarse en http: / /www.php.net / books.php.

source: There are a number of active mailing lists for discussion of all aspects of programming with PHP.
es: Existen una serie de listas de correo en donde se puede discutir sobre diferentes aspectos relacionados con la programación en PHP.

source: If you find yourself stuck on a problem for which you can 't find your own solution, you may be able to get help from someone on these lists.
es: Si tienes un problema, el cual no puedes solucionar, puedes usar estas listas para preguntar y obtener ayuda.

source: You can find a list of the mailing lists at http: / /www.php.net / support.php, as well as links to the mailing list archives and other online support resources.
es: Una lista con las listas de correo disponibles puede encontrarse en http: / /www.php.net / support.php, asi como enlaces a los archivos historicos de estas listas y otros recursos de ayuda en línea.

source: Furthermore, at http: / /www.php.net / links.php there is a list of websites devoted to PHP articles, forums, and code galleries.
es: Además en http: / /www.php.net / links.php puedes encontrar información sobre servidores web dedicados a PHP, artículos, foros y galerias de código.

source: PHP versions documented in this manual
es: Sobre las notas de usuarios

source: The user-contributed notes play an important role in the development of this manual.
es: Las notas de usuarios juegan un importante papael en el desarrollo de este manual.

source: And until the notes have been incorporated, they can be viewed in their submitted form online and in some of the offline formats.
es: Permitiendo a los lectores del manual contribuir con ejemplos y aclaraciones desde su navegador, podemos incorporar estas aclaraciones en el manual.

source: The user-contributed notes are not moderated before they appear online, so the quality of the writing or code examples, and even the veracity of the contribution, cannot be guaranteed. (Not that there is any guarantee of the quality or accuracy of the manual text itself.)
es: Hasta que las notas son incorporadas en el manual, pueden ser accedidas desde el manual en línea y algunos formatos fuera de línea.

source: For more details see the Manual 's Copyright page.
es: Las notas de usuario no son moderadas antes de estar disponibles en línea, asi que la calidad de lo escrito asi como los ejemplos ó incluso la veracidad de lo expuesto en la nota no puede ser garantizada.

source: About the manual
es: Sobre el manual

source: How to read a function definition (prototype)
es: Como encontrar más información sobre PHP

source: Appendix K.
es: Apéndice K.

source: The PHP manual is not only available in various formats, it is also available in various languages.
es: El manual de PHP no está disponible solamente en diferentes formatos, tambien se encuentra en diferentes idiomas.

source: The text of the manual is first written in english, then teams of people across the world take care of translating it to their native language.
es: El manual es escrito primero en ingles y luego grupos de traductores de todo el mundo se encargan de mantener la traducción a su idioma sincronizada con la versión inglesa.

source: If a translation for a specified function or chapter has not yet been made, the build system of the manual falls back to the english version of it.
es: Si la traducción de algún apartado del manual no ha sido realizada todavia por el equipo de traductores, este aparecerá en ingles hasta que sea traducido.

source: Peoples involved in the translations start from the XML source code available from http: / /cvs.php.net / and from it they translate to thier mother language.
es: Las personas involucradas en las traducciones, utilizan el código fuente en XML disponible en http: / /cvs.php.net / y lo traducen a su idioma.

source: They do not use the HTML, the plain text, or the PDF version.
es: No utilizan la versión en HTML, texto plano ó PDF.

source: It is the build system which takes care of the conversions from XML to human readable formats.
es: Es el sistema de generación de formatos el que se encarga de producirlos a partir de XML.

source: If you would like to help translating the documentation to your native language, please get in touch with the translation / documentation team subscribing to the phpdoc mailinglist: send an empty mail to phpdoc-subscribe@lists.php.net.
es: Manda un mensaje vacio a phpdoc-subscribe@lists.php.net.

source: The mailing list address is phpdoc@lists.php.net.
es: La dirección de la esta lista de correo es phpdoc@lists.php.net.

source: State in the message that you are interested in translating the manual to a language and someone will get back to you, helping you start a new language translation or reach the already active documentation team for your language.
es: Explica que estás interesado en traducir el manual a un idioma y nos pondremos en contacto contigo, te mandaremos información para que puedas empezar una nueva traducción o para que pases a formar parte del equipo de traducción de tu idioma, si este ya existe.

source: At the moment the manual is available, partly or not, in the following languages:
es: Por el momento existen traducciones, completas o en parciales, en los siguientes idiomas:

source: Brazilian Portuguese, Chinese, Czech, Dutch, French, German, Hungarian, Italian, Japanese, Korean, Polish and Spanish.
es: Brasileño, Portugues, Checo, Holandés, Finlandés, Frances, Alemán, Hungaro, Italiano, Japones, Koreano, Polaco, rumano, Ruso, Español y Turco.

source: They all can be downloaded here: http: / /www.php.net / docs.php.
es: Todas ellas se pueden bajar de: http: / /www.php.net / docs.php.

source: How we generate the formats
es: Como generamos los formatos

source: Missing Stuff
es: Sobre la traducción al español

source: Here is the aliases list.
es: Aqui teneis la lista de alias de funciones.

source: It is usually a bad idea to use aliases, as they may be bound to obsolescence or renaming, which will lead to unportable script.
es: Todos loas alias están listados aqui. en general es una mala idea usar alias, ya que pueden ser modificados o renombrados, por lo que tu código no podra utilizarse.

source: This list is provided to help those who want to upgrade their old scripts to newer syntax.
es: Esta lista se provee para que quien quiera actualizar su código antiguo a la sintaxis actual.

source: However, some functions simply have two names, and there is no real preference. (For example, is_int() and is_integer() are equally good)
es: De todas maneras, algunas funciones tienen dos nombres, sin preferencia por uno u otro. (Por ejemplo, is_int() y is_integer() som válidas indistintamente)

source: For an alias list that updates daily, have a look here.
es: Esta lista es consistente con PHP 4.0.6.

source: Table F-1.
es: Tabla F-1.

source: Master function
es: Función principal

source: Extension used
es: Extensión usada

source: Reporting Errors
es: Informando de errores

source: Prev
es: Materia que falta

source: Miscellaneous Questions
es: Siguiente

source: History of PHP and related projects
es: Historia de PHP y proyectos relacionados

source: Appendix E.
es: Apéndice E.

source: Extending PHP
es: Desarrollo en PHP

source: To call user functions from an internal function, you should use the call_user_function() function.
es: Para llamar a funciones del usuario desde una función interna, deberá usar la función call_user_function().

source: You should check that return value!
es: call_user_function() devuelve SUCCESS si tiene éxito y FAILURE en caso de que la función no sea hallada. ¡Deberá comprobar ese valor de retorno!

source: If it returns SUCCESS, you are responsible for destroying the retval pval yourself (or return it as the return value of your function).
es: Si devuelve SUCCESS, debe usted ocuparse de destruir el pval devuelto (o devolverlo como el valor de retorno de su función).

source: If it returns FAILURE, the value of retval is undefined, and you mustn 't touch it.
es: Si devuelve FAILURE, el valor de valret no está definido y no debe tocarlo.

source: All internal functions that call user functions must be reentrant.
es: Todas las funciones internas que llaman a funciones de usuario deben ser reentrantes.

source: Among other things, this means they must not use globals or static variables.
es: Entre otras cosas, esto quiere decir que no se utilicen variables globales ni estáticas.

source: call_user_function() takes six arguments:
es: call_user_function() lleva 6 argumentos:

source: This is the hash table in which the function is to be looked up.
es: Esta es la matriz asociativa en la que se buscará la función.

source: This is a pointer to an object on which the function is invoked.
es: Este es un puntero a un objeto sobre el que se invoca la función.

source: This should be NULL if a global function is called.
es: Deberá valer NULL si se llama a una función global.

source: If it' s not NULL (i.e. it points to an object), the function_table argument is ignored, and instead taken from the object's hash.
es: Si no es NULL (es decir, si apunta a un objeto), el argumento tabla_funciones se ignora y se toma su valor a partir de la codificación del objeto.

source: The object *may* be modified by the function that is invoked on it (that function will have access to it via $this).
es: El objeto *puede* ser modificado por dicha función (ésta accede a él a través de $this).

source: If for some reason you don 't want that to happen, send a copy of the object instead.
es: Si por alguna razón no desea que eso ocurra, envíe entonces una copia del objeto.

source: The name of the function to call.
es: El nombre de la función a llamar.

source: Must be a pval of type IS_STRING with function_name.str.val and function_name.str.len set to the appropriate values.
es: Debe ser un pval de tipo IS_STRING, con nombre_func.str.val y nombre_func.str.len fijados a los valores apropiados.

source: The function_name is modified by call_user_function() - it's converted to lowercase.
es: El nombre_func es modificado por call_user_function(), que lo convierte a minúsculas.

source: If you need to preserve the case, send a copy of the function name instead.
es: Si necesita preservar el nombre, envíe una copia del mismo.

source: A pointer to a pval structure, into which the return value of the invoked function is saved.
es: Un puntero a una estructura pval, en la que se guarda el valor de returno de la función.

source: The structure must be previously allocated - call_user_function() does NOT allocate it by itself.
es: Hay que asignar espacio a la estructura previamente, porque la función call_user_function() NO lo asigna por sí misma.

source: The number of parameters being passed to the function.
es: El número de parámetros que se pasan a la función.

source: An array of pointers to values that will be passed as arguments to the function, the first argument being in offset 0, the second in offset 1, etc.
es: El primer argumento está en el elemento 0, el segundo en el elemento 1, etc.

source: The array is an array of pointers to pval' s; The pointers are sent as-is to the function, which means if the function modifies its arguments, the original values are changed (passing by reference).
es: Los punteros se envían tal cual a la función, lo que quiere decir que si la función modifica sus argumentos, se modifican los valores originales (paso por referencia).

source: If you don 't want that behavior, pass a copy instead.
es: Si no desea ese comportamiento, pase una copia.

source: COM support functions for Windows
es: soporte de las funciones COM para Windows

source: A pseudo-object oriented mechanism for reading a directory.
es: (PHP 3, PHP 4)

source: Two properties are available once the directory has been opened.
es: Un mecanismo semi-orientado a objetos para leer directorios.

source: The handle property can be used with other directory functions such as readdir(), rewinddir() and closedir().
es: El parametro directory abre el directorio.

source: Three methods are available: read, rewind and close.
es: Dos propiedades estan disponibles cuando el directorio ha sido abierto.

source: We are explicitly testing whether the return value is identical to (equal to and of the same type as--see Comparison Operators for more information) FALSE since otherwise, any directory entry whose name evaluates to FALSE will stop the loop.
es: La propiedad de manejo puede ser usada con otras funciones de directorios tal como readdir(), rewinddir() y closedir().

source: $d = dir( "/ etc"); echo "Handle: ".$d - handle." br \n"; echo "Path: ".$d - path. "br \n"; while (false !== ($entry = $d - read())) {echo $entry." br \n";} $d - close();
es: La propiedad de trayectoria (path) es fijada para encaminar el directorio que ha sido abierto.

source: The order in which directory entries are returned by the read method is system-dependent.
es: Tres metodos estan disponibles: leer, rebobinar y cerrar.

source: For a full list of predefined classes in PHP, please see Predefined Classes.
es: $d = dir( "/ etc"); echo "Handle: ".$d - handle." br \n"; echo "Path: ".$d - path. "br \n"; while($entry=$d - read()) {echo $entry." br \n";} $d - close();

source: The configuration file (called php3.ini in PHP 3.0, and simply php.ini as of PHP 4.0) is read when PHP starts up.
es: Con el PHP 3.0 hay directivas Apache que se corresponden a cada uno de los ajustes de configuración del php3.ini, con la excepción que su nombre va precedido de "php3_".

source: For the server module versions of PHP, this happens only once when the web server is started.
es: Poniendo php3_engine off en los sitios apropiados del archivo httpd.conf, se puede habilitar o deshabilitar el PHP.

source: For the CGI and CLI version, it happens on every invocation.
es: Fijándola, por ejemplo, a "GP", hará que el PHP ignore por completo las cookies y que sobreescriba las variables recibidas por GET con las que tengan el mismo nombre y vengan por POST.
